-------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\aguido\Documents\GitHub\Social_norm_meta_analysis\Analysis\uncertain_stata_AIC_ONG.log
  log type:  text
 opened on:  25 Sep 2023, 18:07:05

.  
. foreach l of local levels {
  2.   di "`l'" "`NU_AIC`l''"
  3.  }
2007Lis165_1a99.22787742514575
2012Laz164_3488.6370140230742
2013Kru001_1a212.0190533885154
2016Kim003_7288.6306137281586
2018Her061_9111.1548379510198
2019Cha026_1217.424961404821
2020Bas115_2a456.0502395696125

. 
. eststo clear

. eststo :clogit a payoff mean_app, group(id) vce(cluster treatment_id)
note: 1 group (17 obs) dropped because of all positive or
      all negative outcomes.

Iteration 0:   log pseudolikelihood = -1063.9625  
Iteration 1:   log pseudolikelihood =  -991.5064  
Iteration 2:   log pseudolikelihood = -985.07718  
Iteration 3:   log pseudolikelihood = -985.03891  
Iteration 4:   log pseudolikelihood = -985.03891  

Conditional (fixed-effects) logistic regression

                                                Number of obs     =      5,874
                                                Wald chi2(2)      =      49.30
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -985.03891               Pseudo R2         =     0.1945

                           (Std. Err. adjusted for 7 clusters in treatment_id)
------------------------------------------------------------------------------
             |               Robust
           a |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      payoff |   .6876973   .1177469     5.84   0.000     .4569176    .9184771
    mean_app |   2.110329   .3005634     7.02   0.000     1.521236    2.699423
------------------------------------------------------------------------------
(est1 stored)

. eststo :clogit a payoff mean_app sd_app, group(id) iter(50) vce(cluster treatment_id) collinear
note: 1 group (17 obs) dropped because of all positive or
      all negative outcomes.

Iteration 0:   log pseudolikelihood = -1034.1288  
Iteration 1:   log pseudolikelihood = -981.55854  
Iteration 2:   log pseudolikelihood = -976.86936  
Iteration 3:   log pseudolikelihood = -976.83527  
Iteration 4:   log pseudolikelihood = -976.83526  

Conditional (fixed-effects) logistic regression

                                                Number of obs     =      5,874
                                                Wald chi2(3)      =      66.40
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -976.83526               Pseudo R2         =     0.2012

                           (Std. Err. adjusted for 7 clusters in treatment_id)
------------------------------------------------------------------------------
             |               Robust
           a |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      payoff |   .5840637   .1045265     5.59   0.000     .3791954    .7889319
    mean_app |   1.581632   .3699387     4.28   0.000     .8565656    2.306699
      sd_app |  -3.206224   .9712965    -3.30   0.001     -5.10993   -1.302518
------------------------------------------------------------------------------
(est2 stored)

. eststo :clogit a payoff rho sigma mean_app sd_app, group(id) iter(50) vce(cluster treatment_id) collinear constraint(1)
note: 1 group (17 obs) dropped because of all positive or
      all negative outcomes.

Iteration 0:   log pseudolikelihood = -2241.7019  
Iteration 1:   log pseudolikelihood = -2065.6811  (backed up)
Iteration 2:   log pseudolikelihood = -1929.7042  
Iteration 3:   log pseudolikelihood = -1117.6941  
Iteration 4:   log pseudolikelihood = -1016.4396  
Iteration 5:   log pseudolikelihood = -977.69977  
Iteration 6:   log pseudolikelihood = -976.49607  
Iteration 7:   log pseudolikelihood = -976.49603  

Conditional (fixed-effects) logistic regression

                                                Number of obs     =      5,874
                                                Wald chi2(4)      =     301.22
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -976.49603               Pseudo R2         =     0.2015

 ( 1)  [a]payoff = 1
                           (Std. Err. adjusted for 7 clusters in treatment_id)
------------------------------------------------------------------------------
             |               Robust
           a |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      payoff |          1  (constrained)
         rho |   .2265129   .0898715     2.52   0.012      .050368    .4026578
       sigma |   .1496639   .1948037     0.77   0.442    -.2321444    .5314722
    mean_app |   1.502708   .4892435     3.07   0.002     .5438086    2.461608
      sd_app |  -2.788024   1.484729    -1.88   0.060     -5.69804    .1219921
------------------------------------------------------------------------------
(est3 stored)

. esttab using uncertainty_models.tex, label replace aic bic se 
(output written to uncertainty_models.tex)

. 
. eststo clear

. eststo :clogit a payoff mean_app, group(id) vce(bootstrap, strata(treatment_id))
(running clogit on estimation sample)

Bootstrap replications (50)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50

Conditional (fixed-effects) logistic regression

Number of strata   =         7                  Number of obs     =      5,874
                                                Replications      =         50
                                                Wald chi2(2)      =    7949.18
                                                Prob > chi2       =     0.0000
Log likelihood = -985.03891                     Pseudo R2         =     0.1945

                                    (Replications based on 498 clusters in id)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
           a |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      payoff |   .6876973   .0106623    64.50   0.000     .6667997     .708595
    mean_app |   2.110329   .1212787    17.40   0.000     1.872627    2.348031
------------------------------------------------------------------------------
(est1 stored)

. eststo :clogit a payoff mean_app sd_app, group(id) iter(50) vce(cluster treatment_id) collinear
note: 1 group (17 obs) dropped because of all positive or
      all negative outcomes.

Iteration 0:   log pseudolikelihood = -1034.1288  
Iteration 1:   log pseudolikelihood = -981.55854  
Iteration 2:   log pseudolikelihood = -976.86936  
Iteration 3:   log pseudolikelihood = -976.83527  
Iteration 4:   log pseudolikelihood = -976.83526  

Conditional (fixed-effects) logistic regression

                                                Number of obs     =      5,874
                                                Wald chi2(3)      =      66.40
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -976.83526               Pseudo R2         =     0.2012

                           (Std. Err. adjusted for 7 clusters in treatment_id)
------------------------------------------------------------------------------
             |               Robust
           a |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      payoff |   .5840637   .1045265     5.59   0.000     .3791954    .7889319
    mean_app |   1.581632   .3699387     4.28   0.000     .8565656    2.306699
      sd_app |  -3.206224   .9712965    -3.30   0.001     -5.10993   -1.302518
------------------------------------------------------------------------------
(est2 stored)

. eststo :clogit a payoff rho sigma mean_app sd_app, group(id) iter(50) vce(bootstrap, strata(treatment_id)) collinear constraint(1)
(running clogit on estimation sample)

Bootstrap replications (50)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50

Conditional (fixed-effects) logistic regression

Number of strata   =         7                  Number of obs     =      5,874
                                                Replications      =         50
                                                Wald chi2(4)      =    1234.39
Log likelihood = -976.49603                     Prob > chi2       =     0.0000

 ( 1)  [a]payoff = 1
                                    (Replications based on 498 clusters in id)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
           a |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      payoff |          1  (constrained)
         rho |   .2265129   .0363767     6.23   0.000     .1552159    .2978099
       sigma |   .1496639   .1071207     1.40   0.162    -.0602888    .3596166
    mean_app |   1.502708   .3807125     3.95   0.000     .7565256    2.248891
      sd_app |  -2.788024    .694102    -4.02   0.000    -4.148439   -1.427609
------------------------------------------------------------------------------
(est3 stored)

. esttab using uncertainty_models.tex, label replace aic bic se 
(output written to uncertainty_models.tex)

. 
. *eststo :clogit a payoff mean_app, group(id) iter(50) collinear constraint(1)
. *eststo :clogit a payoff rho sigma mean_app, group(id) iter(50) collinear constraint(1)
. *suest est5 est6, vce(cluster treatment_id)
. *test [est6_a]mean_app= [est5_a]mean_app
. 
. restore
nothing to restore
r(622);

end of do-file

r(622);

. do "C:\Users\aguido\AppData\Local\Temp\STD00000000.tmp"

. eststo :clogit a payoff rho sigma mean_app sd_app, group(id) iter(50) vce(cluster treatment_id) collinear constraint(1)
note: 1 group (17 obs) dropped because of all positive or
      all negative outcomes.

Iteration 0:   log pseudolikelihood = -2241.7019  
Iteration 1:   log pseudolikelihood = -2065.6811  (backed up)
Iteration 2:   log pseudolikelihood = -1929.7042  
Iteration 3:   log pseudolikelihood = -1117.6941  
Iteration 4:   log pseudolikelihood = -1016.4396  
Iteration 5:   log pseudolikelihood = -977.69977  
Iteration 6:   log pseudolikelihood = -976.49607  
Iteration 7:   log pseudolikelihood = -976.49603  

Conditional (fixed-effects) logistic regression

                                                Number of obs     =      5,874
                                                Wald chi2(4)      =     301.22
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -976.49603               Pseudo R2         =     0.2015

 ( 1)  [a]payoff = 1
                           (Std. Err. adjusted for 7 clusters in treatment_id)
------------------------------------------------------------------------------
             |               Robust
           a |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      payoff |          1  (constrained)
         rho |   .2265129   .0898715     2.52   0.012      .050368    .4026578
       sigma |   .1496639   .1948037     0.77   0.442    -.2321444    .5314722
    mean_app |   1.502708   .4892435     3.07   0.002     .5438086    2.461608
      sd_app |  -2.788024   1.484729    -1.88   0.060     -5.69804    .1219921
------------------------------------------------------------------------------
(est4 stored)

. 
end of do-file

. do "C:\Users\aguido\AppData\Local\Temp\STD00000000.tmp"

. eststo :clogit a payoff, group(id) vce(cluster treatment_id)
note: 1 group (17 obs) dropped because of all positive or
      all negative outcomes.

Iteration 0:   log pseudolikelihood = -1080.0257  
Iteration 1:   log pseudolikelihood = -1064.1285  
Iteration 2:   log pseudolikelihood = -1064.1284  

Conditional (fixed-effects) logistic regression

                                                Number of obs     =      5,874
                                                Wald chi2(1)      =      84.75
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -1064.1284               Pseudo R2         =     0.1298

                           (Std. Err. adjusted for 7 clusters in treatment_id)
------------------------------------------------------------------------------
             |               Robust
           a |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      payoff |   .2664154   .0289387     9.21   0.000     .2096966    .3231341
------------------------------------------------------------------------------
(est5 stored)

. 
end of do-file

. eststo :clogit a payoff, group(id) vce(rob)
note: 1 group (17 obs) dropped because of all positive or
      all negative outcomes.

Iteration 0:   log pseudolikelihood = -1080.0257  
Iteration 1:   log pseudolikelihood = -1064.1285  
Iteration 2:   log pseudolikelihood = -1064.1284  

Conditional (fixed-effects) logistic regression

                                                Number of obs     =      5,874
                                                Wald chi2(1)      =     305.23
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -1064.1284               Pseudo R2         =     0.1298

                                     (Std. Err. adjusted for clustering on id)
------------------------------------------------------------------------------
             |               Robust
           a |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      payoff |   .2664154   .0152492    17.47   0.000     .2365275    .2963033
------------------------------------------------------------------------------
(est6 stored)

. do "C:\Users\aguido\AppData\Local\Temp\STD00000000.tmp"

. eststo :clogit a payoff mean_app, group(id) vce(cluster treatment_id)
note: 1 group (17 obs) dropped because of all positive or
      all negative outcomes.

Iteration 0:   log pseudolikelihood = -1063.9625  
Iteration 1:   log pseudolikelihood =  -991.5064  
Iteration 2:   log pseudolikelihood = -985.07718  
Iteration 3:   log pseudolikelihood = -985.03891  
Iteration 4:   log pseudolikelihood = -985.03891  

Conditional (fixed-effects) logistic regression

                                                Number of obs     =      5,874
                                                Wald chi2(2)      =      49.30
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -985.03891               Pseudo R2         =     0.1945

                           (Std. Err. adjusted for 7 clusters in treatment_id)
------------------------------------------------------------------------------
             |               Robust
           a |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      payoff |   .6876973   .1177469     5.84   0.000     .4569176    .9184771
    mean_app |   2.110329   .3005634     7.02   0.000     1.521236    2.699423
------------------------------------------------------------------------------
(est7 stored)

. eststo :clogit a payoff mean_app sd_app, group(id) iter(50) vce(cluster treatment_id) collinear
note: 1 group (17 obs) dropped because of all positive or
      all negative outcomes.

Iteration 0:   log pseudolikelihood = -1034.1288  
Iteration 1:   log pseudolikelihood = -981.55854  
Iteration 2:   log pseudolikelihood = -976.86936  
Iteration 3:   log pseudolikelihood = -976.83527  
Iteration 4:   log pseudolikelihood = -976.83526  

Conditional (fixed-effects) logistic regression

                                                Number of obs     =      5,874
                                                Wald chi2(3)      =      66.40
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -976.83526               Pseudo R2         =     0.2012

                           (Std. Err. adjusted for 7 clusters in treatment_id)
------------------------------------------------------------------------------
             |               Robust
           a |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      payoff |   .5840637   .1045265     5.59   0.000     .3791954    .7889319
    mean_app |   1.581632   .3699387     4.28   0.000     .8565656    2.306699
      sd_app |  -3.206224   .9712965    -3.30   0.001     -5.10993   -1.302518
------------------------------------------------------------------------------
(est8 stored)

. eststo :clogit a payoff rho sigma mean_app sd_app, group(id) iter(50) vce(cluster treatment_id) collinear constraint(1)
note: 1 group (17 obs) dropped because of all positive or
      all negative outcomes.

Iteration 0:   log pseudolikelihood = -2241.7019  
Iteration 1:   log pseudolikelihood = -2065.6811  (backed up)
Iteration 2:   log pseudolikelihood = -1929.7042  
Iteration 3:   log pseudolikelihood = -1117.6941  
Iteration 4:   log pseudolikelihood = -1016.4396  
Iteration 5:   log pseudolikelihood = -977.69977  
Iteration 6:   log pseudolikelihood = -976.49607  
Iteration 7:   log pseudolikelihood = -976.49603  

Conditional (fixed-effects) logistic regression

                                                Number of obs     =      5,874
                                                Wald chi2(4)      =     301.22
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -976.49603               Pseudo R2         =     0.2015

 ( 1)  [a]payoff = 1
                           (Std. Err. adjusted for 7 clusters in treatment_id)
------------------------------------------------------------------------------
             |               Robust
           a |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      payoff |          1  (constrained)
         rho |   .2265129   .0898715     2.52   0.012      .050368    .4026578
       sigma |   .1496639   .1948037     0.77   0.442    -.2321444    .5314722
    mean_app |   1.502708   .4892435     3.07   0.002     .5438086    2.461608
      sd_app |  -2.788024   1.484729    -1.88   0.060     -5.69804    .1219921
------------------------------------------------------------------------------
(est9 stored)

. 
end of do-file

. do "C:\Users\aguido\AppData\Local\Temp\STD00000000.tmp"

. eststo :clogit a payoff rho sigma mean_app sd_app, group(id) iter(50) vce(bootstrap, strata(treatment_id)) collinear constraint(1)
(running clogit on estimation sample)

Bootstrap replications (50)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50

Conditional (fixed-effects) logistic regression

Number of strata   =         7                  Number of obs     =      5,874
                                                Replications      =         50
                                                Wald chi2(4)      =    1311.24
Log likelihood = -976.49603                     Prob > chi2       =     0.0000

 ( 1)  [a]payoff = 1
                                    (Replications based on 498 clusters in id)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
           a |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      payoff |          1  (constrained)
         rho |   .2265129   .0342332     6.62   0.000     .1594171    .2936087
       sigma |   .1496639   .0916214     1.63   0.102    -.0299107    .3292385
    mean_app |   1.502708   .3825577     3.93   0.000     .7529091    2.252507
      sd_app |  -2.788024   .8440747    -3.30   0.001     -4.44238   -1.133668
------------------------------------------------------------------------------
(est10 stored)

. 
end of do-file

.  help vce

. help bootstrap

. eststo :clogit a payoff rho sigma mean_app sd_app, group(id) iter(50) vce(bootstrap, cluster(treatment_id)) collinear constraint(1)
(running clogit on estimation sample)

Bootstrap replications (50)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50

Conditional (fixed-effects) logistic regression

                                                Number of obs     =      5,874
                                                Replications      =         50
                                                Wald chi2(4)      =     114.12
Log likelihood = -976.49603                     Prob > chi2       =     0.0000

 ( 1)  [a]payoff = 1
                            (Replications based on 7 clusters in treatment_id)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
           a |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      payoff |          1  (constrained)
         rho |   .2265129   .1131703     2.00   0.045     .0047032    .4483226
       sigma |   .1496639   .1942635     0.77   0.441    -.2310855    .5304133
    mean_app |   1.502708     .60841     2.47   0.014     .3102466     2.69517
      sd_app |  -2.788024   1.832811    -1.52   0.128    -6.380267    .8042185
------------------------------------------------------------------------------
(est11 stored)

. eststo :clogit a payoff rho sigma mean_app sd_app, group(id) iter(100) vce(bootstrap, cluster(treatment_id)) collinear constraint(1)
(running clogit on estimation sample)

Bootstrap replications (50)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50

Conditional (fixed-effects) logistic regression

                                                Number of obs     =      5,874
                                                Replications      =         50
                                                Wald chi2(4)      =     204.98
Log likelihood = -976.49603                     Prob > chi2       =     0.0000

 ( 1)  [a]payoff = 1
                            (Replications based on 7 clusters in treatment_id)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
           a |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      payoff |          1  (constrained)
         rho |   .2265129   .1014828     2.23   0.026     .0276103    .4254154
       sigma |   .1496639   .2407392     0.62   0.534    -.3221762     .621504
    mean_app |   1.502708   .5458128     2.75   0.006     .4329349    2.572482
      sd_app |  -2.788024   2.157724    -1.29   0.196    -7.017086    1.441038
------------------------------------------------------------------------------
(est12 stored)

. eststo :clogit a payoff rho sigma mean_app sd_app, group(id) iter(100) vce(bootstrap, strata(id) cluster(treatment_id)) collinear constraint(1)
(running clogit on estimation sample)

Bootstrap replications (50)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
singleton cluster detected
r(460);

. eststo :clogit a payoff rho sigma mean_app sd_app, iter(100) vce(bootstrap, strata(id) cluster(treatment_id)) collinear constraint(1)
group() required
r(198);

. eststo :clogit a payoff rho sigma mean_app sd_app, group(treatment_id) iter(100) vce(bootstrap, strata(id) cluster(treatment_id)) collinear constraint(1)
(running clogit on estimation sample)

Bootstrap replications (50)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
singleton cluster detected
r(460);

. eststo :clogit a payoff rho sigma mean_app sd_app, group(treatment_id) iter(100) vce(bootstrap, cluster(id)) collinear constraint(1)
(running clogit on estimation sample)

Bootstrap replications (50)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50

Conditional (fixed-effects) logistic regression

                                                Number of obs     =      5,891
                                                Replications      =         50
                                                Wald chi2(4)      =    1191.09
Log likelihood = -1413.0518                     Prob > chi2       =     0.0000

 ( 1)  [a]payoff = 1
                                    (Replications based on 499 clusters in id)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
           a |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      payoff |          1  (constrained)
         rho |   .1784216   .0409249     4.36   0.000     .0982103     .258633
       sigma |   .1548757   .1356585     1.14   0.254      -.11101    .4207614
    mean_app |   1.769721   .2552744     6.93   0.000     1.269393     2.27005
      sd_app |  -3.288074   1.037702    -3.17   0.002    -5.321932   -1.254215
------------------------------------------------------------------------------
(est13 stored)

. eststo :clogit a payoff rho sigma mean_app sd_app, group(id) iter(100) vce(bootstrap, cluster(id)) collinear constraint(1)
(running clogit on estimation sample)

Bootstrap replications (50)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50

Conditional (fixed-effects) logistic regression

                                                Number of obs     =      5,874
                                                Replications      =         50
                                                Wald chi2(4)      =    1001.47
Log likelihood = -976.49603                     Prob > chi2       =     0.0000

 ( 1)  [a]payoff = 1
                                    (Replications based on 498 clusters in id)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
           a |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      payoff |          1  (constrained)
         rho |   .2265129   .0408638     5.54   0.000     .1464214    .3066044
       sigma |   .1496639   .1132384     1.32   0.186    -.0722794    .3716072
    mean_app |   1.502708   .2446662     6.14   0.000     1.023171    1.982245
      sd_app |  -2.788024   .8869052    -3.14   0.002    -4.526327   -1.049722
------------------------------------------------------------------------------
(est14 stored)

. eststo :clogit a payoff rho sigma mean_app sd_app, group(id) iter(100) vce(bootstrap, cluster(id)) collinear constraint(1)
(running clogit on estimation sample)

Bootstrap replications (50)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50

Conditional (fixed-effects) logistic regression

                                                Number of obs     =      5,874
                                                Replications      =         50
                                                Wald chi2(4)      =    1565.24
Log likelihood = -976.49603                     Prob > chi2       =     0.0000

 ( 1)  [a]payoff = 1
                                    (Replications based on 498 clusters in id)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
           a |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      payoff |          1  (constrained)
         rho |   .2265129   .0475964     4.76   0.000     .1332257    .3198001
       sigma |   .1496639   .1275017     1.17   0.240    -.1002349    .3995627
    mean_app |   1.502708   .3285915     4.57   0.000     .8586807    2.146736
      sd_app |  -2.788024   1.089055    -2.56   0.010    -4.922534   -.6535148
------------------------------------------------------------------------------
(est15 stored)

. eststo :clogit a payoff rho sigma mean_app sd_app, group(id) iter(100) vce(rob) collinear constraint(1)
note: 1 group (17 obs) dropped because of all positive or
      all negative outcomes.

Iteration 0:   log pseudolikelihood = -2241.7019  
Iteration 1:   log pseudolikelihood = -2065.6811  (backed up)
Iteration 2:   log pseudolikelihood = -1929.7042  
Iteration 3:   log pseudolikelihood = -1117.6941  
Iteration 4:   log pseudolikelihood = -1016.4396  
Iteration 5:   log pseudolikelihood = -977.69977  
Iteration 6:   log pseudolikelihood = -976.49607  
Iteration 7:   log pseudolikelihood = -976.49603  

Conditional (fixed-effects) logistic regression

                                                Number of obs     =      5,874
                                                Wald chi2(4)      =    1463.35
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -976.49603               Pseudo R2         =     0.2015

 ( 1)  [a]payoff = 1
                                     (Std. Err. adjusted for clustering on id)
------------------------------------------------------------------------------
             |               Robust
           a |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      payoff |          1  (constrained)
         rho |   .2265129   .0392025     5.78   0.000     .1496774    .3033484
       sigma |   .1496639   .1118747     1.34   0.181    -.0696065    .3689343
    mean_app |   1.502708   .2507616     5.99   0.000     1.011225    1.994192
      sd_app |  -2.788024    .985442    -2.83   0.005    -4.719455   -.8565934
------------------------------------------------------------------------------
(est16 stored)

. eststo :clogit a payoff rho sigma mean_app sd_app, group(id) iter(100) vce(cluster treatment_id ) collinear constraint(1)
note: 1 group (17 obs) dropped because of all positive or
      all negative outcomes.

Iteration 0:   log pseudolikelihood = -2241.7019  
Iteration 1:   log pseudolikelihood = -2065.6811  (backed up)
Iteration 2:   log pseudolikelihood = -1929.7042  
Iteration 3:   log pseudolikelihood = -1117.6941  
Iteration 4:   log pseudolikelihood = -1016.4396  
Iteration 5:   log pseudolikelihood = -977.69977  
Iteration 6:   log pseudolikelihood = -976.49607  
Iteration 7:   log pseudolikelihood = -976.49603  

Conditional (fixed-effects) logistic regression

                                                Number of obs     =      5,874
                                                Wald chi2(4)      =     301.22
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -976.49603               Pseudo R2         =     0.2015

 ( 1)  [a]payoff = 1
                           (Std. Err. adjusted for 7 clusters in treatment_id)
------------------------------------------------------------------------------
             |               Robust
           a |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      payoff |          1  (constrained)
         rho |   .2265129   .0898715     2.52   0.012      .050368    .4026578
       sigma |   .1496639   .1948037     0.77   0.442    -.2321444    .5314722
    mean_app |   1.502708   .4892435     3.07   0.002     .5438086    2.461608
      sd_app |  -2.788024   1.484729    -1.88   0.060     -5.69804    .1219921
------------------------------------------------------------------------------
(est17 stored)

. do "C:\Users\aguido\AppData\Local\Temp\STD00000000.tmp"

. set more off

. * RUN ANDREA *
. clear all

. cd "C:\Users\aguido\Documents\GitHub\Social_norm_meta_analysis\Analysis"
C:\Users\aguido\Documents\GitHub\Social_norm_meta_analysis\Analysis

. import delimited "C:\Users\aguido\Documents\GitHub\Social_norm_meta_analysis\Analysis\data_utility.csv", clear
(17 vars, 10,535 obs)

. *log using "C:\Users\aguido\Documents\GitHub\Social_norm_meta_analysis\Analysis\stata.log", replace
. 
. * DG *
. *preserve 
. drop if game_type != "DG"
(4,644 observations deleted)

. 
. * set constraint for social preferences models *
. constraint 1 payoff = 1

. constraint 2 rho = 0

. constraint 3 sigma = rho

. constraint 4 sigma = 0

. 
. levelsof treatment_id, local(levels)
`"2007Lis165_1a"' `"2012Laz164_3"' `"2013Kru001_1a"' `"2016Kim003_7"' `"2018Her061_9"' `"2019Cha026_1"' `"2020Bas115_2a"'

. 
. * Charness Rabin 2002 *
. gen r = payoff > endowment/2

. gen s = payoff < endowment/2

. gen rho = endowment*r-2*payoff*r

. gen sigma = endowment*s-2*payoff*s

. gen alpha = endowment - 2*payoff

. 
. *log using stata_MODELS_DG.log, replace
. /*
> foreach l of local levels {
>         di "treatment -> `l' "
>         
>         /* S - Selfish */
>         clogit a payoff if treatment_id == "`l'", group(id) iter(50) vce(rob)
>         est store S`l'
>         local deltaS`l' = _b[payoff]
>         local se_deltaS`l' = _se[payoff]
>         
>         /* N - Social expectation - Norm */
>         clogit a payoff mean_app if treatment_id == "`l'", group(id) vce(rob)
>         est store N`l'
>         local deltaN`l' = _b[payoff]
>         local gammaN`l' = _b[mean_app]
>         local se_deltaN`l' = _se[payoff]
>         local se_gammaN`l' = _se[mean_app]
>         
>         /* BA - Behindness averse */
>         clogit a payoff rho sigma if treatment_id == "`l'", group(id) iter(50) vce(rob) collinear constraints(1 2)
>         est store BA`l'
>         local rhoBA`l' = _b[rho]
>         local sigmaBA`l' = _b[sigma]
>         local se_rhoBA`l' = _se[rho]
>         local se_sigmaBA`l' = _se[sigma]
>         
>         /* CP - Charity prone */
>         clogit a payoff rho sigma if treatment_id == "`l'", group(id) iter(50) vce(rob) collinear constraints(1 4)
>         est store CP`l'
>         local rhoCP`l' = _b[rho]
>         local sigmaCP`l' = _b[sigma]
>         local se_rhoCP`l' = _se[rho]
>         local se_sigmaCP`l' = _se[sigma]
>         
>         /* DA - Difference averse */
>         clogit a payoff rho sigma if treatment_id == "`l'", group(id) iter(50) vce(rob) collinear constraint(1)
>         est store DA`l'
>         local rhoDA`l' = _b[rho]
>         local sigmaDA`l' = _b[sigma]
>         local se_rhoDA`l' = _se[rho]
>         local se_sigmaDA`l' = _se[sigma]
>         
>         /* FU - Full model (social norms and social preferences)*/
>         clogit a payoff rho sigma mean_app if treatment_id == "`l'", group(id) iter(50) vce(rob) collinear constraint(1)
>         est store FU`l'
>         local rhoFU`l' = _b[rho]
>         local sigmaFU`l' = _b[sigma]
>         local gammaFU`l' = _b[mean_app]
>         local se_rhoFU`l' = _se[rho]
>         local se_sigmaFU`l' = _se[sigma]
>         local se_gammaFU`l' = _se[mean_app]
> 
>         qui tab id if e(sample)
>         local nobs_FU`l' = r(r)
>         
> }
> 
> foreach l of local levels {
> estimates stats N`l' BA`l' CP`l' DA`l' S`l' FU`l'
> matrix temp = r(S)
> local N_AIC`l' = temp[1,5]
> local BA_AIC`l' = temp[2,5]
> local CP_AIC`l' = temp[3,5]
> local DA_AIC`l' = temp[4,5]
> local S_AIC`l' = temp[5,5]
> local FU_AIC`l' = temp[6,5]
> }
> 
> log close
> 
> 
> /*
> /* STAMPA TABELLA COEFFICIENTS IN FORMATO LOG */
> 
> log using stata_COEFF_ONG.log, replace
> 
> foreach l of local levels {
>   di "`l' `deltaS`l'' `deltaN`l'' `gammaN`l'' `sigmaBA`l'' `rhoCP`l'' `rhoDA`l'' `sigmaDA`l'' `rhoFU`l'' `sigmaFU`l'' `gammaFU`l''" 
>  }
> 
> log close
>  
>  
>   /* STAMPA TABELLA STD DEV IN FORMATO LOG */
> log using stata_SE_ONG.log, replace
> 
> foreach l of local levels {
>   di "`l' `se_deltaS`l'' `se_deltaN`l'' `se_gammaN`l'' `se_sigmaBA`l'' `se_rhoCP`l'' `se_rhoDA`l'' `se_sigmaDA`l'' `se_rhoFU`l'' `se_sigmaFU`l'' `se_gammaF
> U`l''"
>  } 
> 
> log close
> 
> 
> /* STAMPA TABELLA AIC IN FORMATO LOG */ 
> 
> log using stata_AIC_ONG.log, replace
>  
> foreach l of local levels {
>   di "`l' `S_AIC`l'' `N_AIC`l'' `BA_AIC`l'' `CP_AIC`l'' `DA_AIC`l'' `FU_AIC`l''"
>  }
> 
>  
> log close
> 
> log using stata_Nobs.log, replace
>  
> foreach l of local levels {
>   di "`l' `nobs_FU`l''"
>  }
> 
> log close
> */ 
> * overall model *
> eststo clear
> eststo :clogit a payoff, group(id) vce(cluster treatment_id)
> eststo :clogit a payoff rho sigma, group(id) iter(50) vce(cluster treatment_id) collinear constraint(1) 
> eststo :clogit a payoff mean_app, group(id) vce(cluster treatment_id)
> eststo :clogit a payoff rho sigma mean_app, group(id) iter(50) vce(cluster treatment_id) collinear constraint(1)
> esttab using overall_models.tex, label replace aic bic se 
> */
. 
. ** Norm uncertainty models **
. 
. foreach l of local levels {
  2.         di "treatment -> `l' "
  3. 
.         /* NU - social norms and uncertainty */
.         clogit a payoff mean_app sd_app if treatment_id == "`l'", group(id) iter(50) vce(rob) collinear
  4.         est store NU`l'
  5.         local deltaNU`l' = _b[payoff]
  6.         local gammaNU`l' = _b[mean_app]
  7.         local etaNU`l' = _b[sd_app]
  8.         local se_gammaNU`l' = _se[mean_app]
  9.         local se_etaNU`l' = _se[sd_app]
 10. 
.         qui tab id if e(sample)
 11.         local nobs_NU`l' = r(r)
 12. }
treatment -> 2007Lis165_1a 

Iteration 0:   log pseudolikelihood = -46.706053  
Iteration 1:   log pseudolikelihood = -46.614299  
Iteration 2:   log pseudolikelihood = -46.613939  
Iteration 3:   log pseudolikelihood = -46.613939  

Conditional (fixed-effects) logistic regression

                                                Number of obs     =        264
                                                Wald chi2(3)      =      10.30
                                                Prob > chi2       =     0.0162
Log pseudolikelihood = -46.613939               Pseudo R2         =     0.1900

                                     (Std. Err. adjusted for clustering on id)
------------------------------------------------------------------------------
             |               Robust
           a |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      payoff |    2.09135   .7171214     2.92   0.004     .6858181    3.496882
    mean_app |    3.77049   1.554497     2.43   0.015     .7237328    6.817248
      sd_app |   8.040752   6.336811     1.27   0.204     -4.37917    20.46067
------------------------------------------------------------------------------
treatment -> 2012Laz164_3 

Iteration 0:   log pseudolikelihood = -242.10381  
Iteration 1:   log pseudolikelihood = -241.32351  
Iteration 2:   log pseudolikelihood = -241.31851  
Iteration 3:   log pseudolikelihood = -241.31851  

Conditional (fixed-effects) logistic regression

                                                Number of obs     =      1,485
                                                Wald chi2(3)      =      54.16
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -241.31851               Pseudo R2         =     0.2545

                                     (Std. Err. adjusted for clustering on id)
------------------------------------------------------------------------------
             |               Robust
           a |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      payoff |    .685298   .4204353     1.63   0.103    -.1387401    1.509336
    mean_app |   1.598316   1.604013     1.00   0.319    -1.545492    4.742124
      sd_app |  -5.649195   5.250809    -1.08   0.282    -15.94059    4.642202
------------------------------------------------------------------------------
treatment -> 2013Kru001_1a 

Iteration 0:   log pseudolikelihood = -103.14637  
Iteration 1:   log pseudolikelihood = -103.01004  
Iteration 2:   log pseudolikelihood = -103.00953  
Iteration 3:   log pseudolikelihood = -103.00953  

Conditional (fixed-effects) logistic regression

                                                Number of obs     =        572
                                                Wald chi2(3)      =      17.43
                                                Prob > chi2       =     0.0006
Log pseudolikelihood = -103.00953               Pseudo R2         =     0.1739

                                     (Std. Err. adjusted for clustering on id)
------------------------------------------------------------------------------
             |               Robust
           a |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      payoff |   .6043326   .3194346     1.89   0.059    -.0217478    1.230413
    mean_app |   1.443581   1.687583     0.86   0.392    -1.864021    4.751183
      sd_app |  -.2316584   6.173739    -0.04   0.970    -12.33196    11.86865
------------------------------------------------------------------------------
treatment -> 2016Kim003_7 
note: 1 group (17 obs) dropped because of all positive or
      all negative outcomes.

Iteration 0:   log pseudolikelihood = -141.69875  
Iteration 1:   log pseudolikelihood = -141.31571  
Iteration 2:   log pseudolikelihood = -141.31531  
Iteration 3:   log pseudolikelihood = -141.31531  

Conditional (fixed-effects) logistic regression

                                                Number of obs     =      1,122
                                                Wald chi2(3)      =      77.02
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -141.31531               Pseudo R2         =     0.2443

                                     (Std. Err. adjusted for clustering on id)
------------------------------------------------------------------------------
             |               Robust
           a |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      payoff |   1.065963   .1520793     7.01   0.000     .7678929    1.364033
    mean_app |   5.316158   .8942617     5.94   0.000     3.563437    7.068878
      sd_app |   4.987563    2.24974     2.22   0.027      .578153    9.396973
------------------------------------------------------------------------------
treatment -> 2018Her061_9 

Iteration 0:   log pseudolikelihood = -54.538668  
Iteration 1:   log pseudolikelihood = -52.614611  
Iteration 2:   log pseudolikelihood = -52.577437  
Iteration 3:   log pseudolikelihood = -52.577419  
Iteration 4:   log pseudolikelihood = -52.577419  

Conditional (fixed-effects) logistic regression

                                                Number of obs     =        418
                                                Wald chi2(3)      =      25.51
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -52.577419               Pseudo R2         =     0.4230

                                     (Std. Err. adjusted for clustering on id)
------------------------------------------------------------------------------
             |               Robust
           a |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      payoff |   3.749555   1.137424     3.30   0.001     1.520246    5.978865
    mean_app |   9.403459   3.261476     2.88   0.004     3.011083    15.79583
      sd_app |  -20.13804   7.013214    -2.87   0.004    -33.88368   -6.392389
------------------------------------------------------------------------------
treatment -> 2019Cha026_1 

Iteration 0:   log pseudolikelihood = -106.21119  
Iteration 1:   log pseudolikelihood = -105.71493  
Iteration 2:   log pseudolikelihood = -105.71248  
Iteration 3:   log pseudolikelihood = -105.71248  

Conditional (fixed-effects) logistic regression

                                                Number of obs     =        616
                                                Wald chi2(3)      =      19.25
                                                Prob > chi2       =     0.0002
Log pseudolikelihood = -105.71248               Pseudo R2         =     0.2128

                                     (Std. Err. adjusted for clustering on id)
------------------------------------------------------------------------------
             |               Robust
           a |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      payoff |   1.091005   .2631655     4.15   0.000       .57521      1.6068
    mean_app |   6.519265    1.59301     4.09   0.000     3.397023    9.641507
      sd_app |    6.56309   2.907175     2.26   0.024     .8651319    12.26105
------------------------------------------------------------------------------
treatment -> 2020Bas115_2a 

Iteration 0:   log pseudolikelihood = -225.33703  
Iteration 1:   log pseudolikelihood = -225.02819  
Iteration 2:   log pseudolikelihood = -225.02512  
Iteration 3:   log pseudolikelihood = -225.02512  

Conditional (fixed-effects) logistic regression

                                                Number of obs     =      1,397
                                                Wald chi2(3)      =      11.50
                                                Prob > chi2       =     0.0093
Log pseudolikelihood = -225.02512               Pseudo R2         =     0.2611

                                     (Std. Err. adjusted for clustering on id)
------------------------------------------------------------------------------
             |               Robust
           a |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      payoff |   1.906378   .7990742     2.39   0.017     .3402212    3.472534
    mean_app |   5.750709   2.381677     2.41   0.016     1.082708    10.41871
      sd_app |   8.762545   6.463655     1.36   0.175    -3.905987    21.43108
------------------------------------------------------------------------------

. 
. foreach l of local levels {
  2.         estimates stats NU`l'
  3.         matrix temp = r(S)
  4.         local NU_AIC`l' = temp[1,5]
  5. }

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
NU2007Lis~1a |        264 -57.54949  -46.61394       3    99.22788   109.9557
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
NU2012Laz1~3 |      1,485 -323.7159  -241.3185       3     488.637   504.5465
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
NU2013Kru~1a |        572 -124.6906  -103.0095       3    212.0191   225.0665
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
NU2016Kim0~7 |      1,122 -186.9921  -141.3153       3    288.6306   303.6992
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
NU2018Her0~9 |        418 -91.12002  -52.57742       3    111.1548   123.2613
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
NU2019Cha0~1 |        616 -134.2821  -105.7125       3     217.425   230.6947
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
NU2020Bas~2a |      1,397 -304.5327  -225.0251       3    456.0502   471.7765
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. 
. /* STAMPA TABELLA COEFFICIENTS IN FORMATO LOG */
. 
. log using uncertain_stata_COEFF_NU.log, replace
log file already open
r(604);

end of do-file

r(604);

. log close
      name:  <unnamed>
       log:  C:\Users\aguido\Documents\GitHub\Social_norm_meta_analysis\Analysis\uncertain_stata_AIC_ONG.log
  log type:  text
 closed on:  25 Sep 2023, 18:25:04
-------------------------------------------------------------------------------------------------------------------------------------------------------------
